app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `name`, `updated_at`) VALUES ('2012-03-09 06:27:18', 'asdasd', '2012-03-09 06:27:18')
INSERT INTO `subproducts` (`created_at`, `name`, `product_id`, `updated_at`) VALUES ('2012-03-09 06:31:41', 'asd123', 1, '2012-03-09 06:31:41')
INSERT INTO `subsubproducts` (`created_at`, `name`, `subproduct_id`, `updated_at`) VALUES ('2012-03-09 10:22:11', 'a1', 116, '2012-03-09 10:22:11')
---
  def create
    if params[:product_id] != ""
      if params[:subproduct_id] != ""
        Subsubproduct.new(:subproduct_id => params[:subproduct_id], :name => params[:name]).save

SELECT `products`.* FROM `products` WHERE `products`.`name` = 'Advertising & Marketing' LIMIT 1
SELECT `subproducts`.* FROM `subproducts` WHERE `subproducts`.`name` = 'Advertising & Marketing' LIMIT 1
SELECT `subsubproducts`.* FROM `subsubproducts` WHERE `subsubproducts`.`name` = 'Conferences and marketing event management' LIMIT 1
---
  def find
    begin
      @paths = Product.find_by_name(params[:product1]).name
    rescue
      begin
        subproduct = Subproduct.find_by_name(params[:product1])
        @paths = subproduct.product.name + " >> " + subproduct.name
      rescue
        begin
          subsubproduct = Subsubproduct.find_by_name(params[:product1])

SELECT `subproducts`.* FROM `subproducts` WHERE `subproducts`.`product_id` = 1
---
  def update_subproduct_select
    # @states = State.where(:countries_id => 1).order(:name) unless params[:id].blank?
    subproducts = Subproduct.find(:all, :conditions => {:product_id => params[:id]})